//
// workbook-01.js
// 問題番号：01 ~ 09
// 各設問に対するプログラムを{}の中に実装しましょう。
//

const q01 = () => {
    // ----------------------------------------
    // 01. 「Hello World!」を表示する
    // ----------------------------------------
    console.log(`Hello Would!`);
};

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q02 = () => {
    // ----------------------------------------
    // 02. 「EC」と「C」を連結して「ECC」を表示する
    // ----------------------------------------
    console.log(`02. 「 EC 」と「 C 」を連結して「ECC」を表示する`);
    console.log("EC" + "C");
};

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q03 = () => {
    // ----------------------------------------
    // 03. データの入力と表示
    // ----------------------------------------
    console.log(`03. 好きなメッセージを入力し、コンソールに表示する`);

    const logText = prompt("何か書いてね");
    console.log(logText);
};

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q04 = () => {
    // ----------------------------------------
    // 04. ２つの数値を入力して、その合計を表示する
    // ----------------------------------------
    console.log(`04. ２つの数値を入力して、その合計を表示する`);

    const numA = parseInt(prompt(`Q04. １つ目の数値を入力`));
    const numB = parseInt(prompt(`Q04. ２つ目の数値を入力`));
    console.log(`${numA} + ${numB} = ${numA + numB}`);
};

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q05 = () => {
    // ----------------------------------------
    // 05. ２つの数値を入力して、その余りを表示する
    // ----------------------------------------
    console.log(`05. ２つの数値を入力して、その余りを表示する`);

    const numC = parseInt(prompt(`Q05. １つ目の数値を入力`));
    const numD = parseInt(prompt(`Q05. ２つ目の数値を入力`));
    console.log(`${numC} ÷ ${numD} の余りは${numC % numD}`);
};

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q06 = () => {
    // ----------------------------------------
    // 06. 2つの整数値を入力して、その和・差・積・商と余りを表示する
    // ----------------------------------------
    console.log(`06. 2つの整数値を入力して、その和・差・積・商・余を表示する`);

    const numE = parseInt(prompt(`Q06. １つ目の数値を入力`));
    const numF = parseInt(prompt(`Q06. ２つ目の数値を入力`));
    console.log(
        `一つ目の数値は:${numE}`,
        `二つ目の数値は:${numF}`,
        `和：${numE + numF}`,
        `差：${numE - numF}`,
        `積：${numE * numF}`,
        `除：${numE / numF}`
    );
};

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q07 = () => {
    // ----------------------------------------
    // 07. 消費税の計算
    // ----------------------------------------
    console.log(`07. 金額と消費税率を入力して、消費税の金額をコンソールに表示する`);

    const price = parseFloat(prompt(`Q07. 金額を入力`));
    const taxNum = parseFloat(prompt(`Q07. 消費税率を入力（%）`));
    const tax = taxNum / 100;
    const addPrice = price * tax;
    console.log(`金額：${price}`, `税額：${taxNum}`, `結果：${addPrice + price}`);
};

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q08 = () => {
    // ----------------------------------------
    // 08. 円の面積
    // ----------------------------------------
    console.log(`08. 半径を入力して、円の面積をコンソールに表示する`);

    const circle = parseInt(prompt(`Q08. 円の半径を入力`));
    console.log(`円の半径：${circle}`, `円の面積：${circle * circle * Math.PI}`);
};

// <-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*->

const q09 = () => {
    //
    // 09. 小数点の桁数指定
    //
    console.log(
        `09. ２つの整数を入力して、その除算結果と小数点以下第２位までに丸めた結果をコンソールに表示する`
    );

    const numG = parseInt(prompt(`Q09. １つ目の数値を入力`));
    const numH = parseInt(prompt(`Q09. ２つ目の数値を入力`));
    const numResult = numG / numH;
    const result = parseFloat(numResult.toFixed(2));
    console.log(
        `1つ目の数値：${numG}`,
        `2つ目の数値：${numH}`,
        `そのままの結果：${numResult}`,
        `小数点を丸めた結果：${result}`
    );
};
